Repository: Rafaell444/Concrete41
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ka

source: FLOWERPOT
ka: საყვავილე ქოთანი

source: ASHTRAY
ka: საფერფლე

source: CHESS
ka: ჭადრაკი

source: LAMP
ka: სანათი

source: SALE
ka: ფასდაკლება

source: ABOUT US
ka: ჩვენს შესახებ

source: NEW ARRIVALS
ka: ახალი

source: Concrete FlowerPot
ka: ბეტონის საყვავილე

source: COLLECTIONS
ka: კოლექცია

source: Quick Links
ka: ნავიგაცია

source: Terms & Conditions
ka: წესები და პირობები

source: Care Instruction
ka: მოვლის ინსტრუქცია

source: Privacy Policy
ka: კონფიდენციალურობის პოლიტიკა

source: Contact Info
ka: საკონტაქტო ინფორმაცია

source: Sign Up On Our Mailing List:
ka: გამოიწერეთ ჩვენი ნიუსლეთერი:
